#include "pch.h"
#include "iostream"
using namespace std;

/*Напишите программу для бармена, который не умеет считать.*/

void task6() {
    cout << "Думать буду часов через 19";
}